
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.slack_alerts_monitoring_reader_appinsights[0]
  * azurerm_role_assignment.slack_alerts_monitoring_reader_workspace[0]
* Delete
  * azurerm_role_assignment.slack_alerts_monitoring_reader[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.slack_alerts_monitoring_reader[0] will be destroyed
  # (because azurerm_role_assignment.slack_alerts_monitoring_reader is not in configuration)
  - resource "azurerm_role_assignment" "slack_alerts_monitoring_reader" {
      - description                            = "Allows slack alerts function app to query Application Insights using Azure AD authentication" -> null
      - id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod/providers/Microsoft.Authorization/roleAssignments/62d71333-d22d-81a0-c245-95206eb8f9b6" -> null
      - name                                   = "62d71333-d22d-81a0-c245-95206eb8f9b6" -> null
      - principal_id                           = "31b0c542-4a7e-4175-9d0c-0a343c7f7a05" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> null
      - role_definition_name                   = "Monitoring Reader" -> null
      - scope                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod" -> null
        # (3 unchanged attributes hidden)
    }

  # azurerm_role_assignment.slack_alerts_monitoring_reader_appinsights[0] will be created
  + resource "azurerm_role_assignment" "slack_alerts_monitoring_reader_appinsights" {
      + condition_version                = (known after apply)
      + description                      = "Allows slack alerts function app to read Application Insights metadata"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "31b0c542-4a7e-4175-9d0c-0a343c7f7a05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.slack_alerts_monitoring_reader_workspace[0] will be created
  + resource "azurerm_role_assignment" "slack_alerts_monitoring_reader_workspace" {
      + condition_version                = (known after apply)
      + description                      = "Allows slack alerts function app to query Application Insights workspace using Azure AD authentication"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "31b0c542-4a7e-4175-9d0c-0a343c7f7a05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":134,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->